reports/stage5/wrkLogsPut1.txt
Running 50s test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 1.876ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.928ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.83ms  460.40us   5.80ms   67.62%
    Req/Sec   527.83     81.91     0.89k    70.91%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.82ms
 75.000%    2.14ms
 90.000%    2.42ms
 99.000%    2.90ms
 99.900%    3.90ms
 99.990%    5.09ms
 99.999%    5.80ms
100.000%    5.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.354     0.000000            1         1.00
       1.237     0.100000         4014         1.11
       1.424     0.200000         8014         1.25
       1.575     0.300000        11996         1.43
       1.706     0.400000        16018         1.67
       1.824     0.500000        20022         2.00
       1.885     0.550000        22018         2.22
       1.943     0.600000        23994         2.50
       2.004     0.650000        25997         2.86
       2.067     0.700000        28031         3.33
       2.137     0.750000        30024         4.00
       2.175     0.775000        31023         4.44
       2.213     0.800000        32025         5.00
       2.257     0.825000        33005         5.71
       2.305     0.850000        33990         6.67
       2.357     0.875000        35002         8.00
       2.385     0.887500        35477         8.89
       2.417     0.900000        35993        10.00
       2.451     0.912500        36491        11.43
       2.489     0.925000        36976        13.33
       2.535     0.937500        37503        16.00
       2.557     0.943750        37726        17.78
       2.583     0.950000        37984        20.00
       2.611     0.956250        38244        22.86
       2.641     0.962500        38483        26.67
       2.673     0.968750        38734        32.00
       2.691     0.971875        38857        35.56
       2.717     0.975000        38982        40.00
       2.747     0.978125        39101        45.71
       2.779     0.981250        39225        53.33
       2.819     0.984375        39357        64.00
       2.841     0.985938        39418        71.11
       2.863     0.987500        39479        80.00
       2.889     0.989062        39537        91.43
       2.919     0.990625        39602       106.67
       2.957     0.992188        39664       128.00
       2.981     0.992969        39694       142.22
       3.001     0.993750        39725       160.00
       3.031     0.994531        39757       182.86
       3.067     0.995313        39789       213.33
       3.109     0.996094        39819       256.00
       3.139     0.996484        39834       284.44
       3.181     0.996875        39850       320.00
       3.223     0.997266        39865       365.71
       3.283     0.997656        39881       426.67
       3.339     0.998047        39896       512.00
       3.377     0.998242        39904       568.89
       3.429     0.998437        39912       640.00
       3.541     0.998633        39920       731.43
       3.795     0.998828        39928       853.33
       3.907     0.999023        39935      1024.00
       4.021     0.999121        39939      1137.78
       4.191     0.999219        39943      1280.00
       4.227     0.999316        39947      1462.86
       4.423     0.999414        39951      1706.67
       4.591     0.999512        39956      2048.00
       4.603     0.999561        39957      2275.56
       4.643     0.999609        39959      2560.00
       4.739     0.999658        39961      2925.71
       4.903     0.999707        39963      3413.33
       4.947     0.999756        39965      4096.00
       4.967     0.999780        39966      4551.11
       4.975     0.999805        39967      5120.00
       5.071     0.999829        39968      5851.43
       5.091     0.999854        39969      6826.67
       5.095     0.999878        39970      8192.00
       5.095     0.999890        39970      9102.22
       5.167     0.999902        39971     10240.00
       5.167     0.999915        39971     11702.86
       5.231     0.999927        39972     13653.33
       5.231     0.999939        39972     16384.00
       5.231     0.999945        39972     18204.44
       5.531     0.999951        39973     20480.00
       5.531     0.999957        39973     23405.71
       5.531     0.999963        39973     27306.67
       5.531     0.999969        39973     32768.00
       5.531     0.999973        39973     36408.89
       5.803     0.999976        39974     40960.00
       5.803     1.000000        39974          inf
#[Mean    =        1.829, StdDeviation   =        0.460]
#[Max     =        5.800, Total count    =        39974]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    1.03ms
 75.000%    1.18ms
 90.000%    1.32ms
 99.000%    1.67ms
 99.900%    2.99ms
 99.990%    4.22ms
 99.999%    4.65ms
100.000%    4.65ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.190     0.000000            1         1.00
       0.778     0.100000         4008         1.11
       0.859     0.200000         7999         1.25
       0.922     0.300000        12016         1.43
       0.977     0.400000        15999         1.67
       1.029     0.500000        20058         2.00
       1.055     0.550000        22053         2.22
       1.082     0.600000        24035         2.50
       1.111     0.650000        26016         2.86
       1.143     0.700000        27986         3.33
       1.178     0.750000        30023         4.00
       1.196     0.775000        30998         4.44
       1.215     0.800000        32001         5.00
       1.235     0.825000        32996         5.71
       1.258     0.850000        34005         6.67
       1.286     0.875000        35009         8.00
       1.301     0.887500        35488         8.89
       1.319     0.900000        35984        10.00
       1.340     0.912500        36486        11.43
       1.363     0.925000        36979        13.33
       1.389     0.937500        37483        16.00
       1.403     0.943750        37737        17.78
       1.422     0.950000        37981        20.00
       1.440     0.956250        38226        22.86
       1.462     0.962500        38488        26.67
       1.492     0.968750        38728        32.00
       1.507     0.971875        38853        35.56
       1.524     0.975000        38980        40.00
       1.545     0.978125        39102        45.71
       1.572     0.981250        39226        53.33
       1.600     0.984375        39353        64.00
       1.614     0.985938        39412        71.11
       1.636     0.987500        39475        80.00
       1.657     0.989062        39541        91.43
       1.685     0.990625        39601       106.67
       1.724     0.992188        39662       128.00
       1.744     0.992969        39694       142.22
       1.768     0.993750        39725       160.00
       1.794     0.994531        39756       182.86
       1.825     0.995313        39787       213.33
       1.870     0.996094        39818       256.00
       1.901     0.996484        39834       284.44
       1.951     0.996875        39850       320.00
       2.022     0.997266        39865       365.71
       2.111     0.997656        39881       426.67
       2.209     0.998047        39896       512.00
       2.283     0.998242        39904       568.89
       2.481     0.998437        39912       640.00
       2.643     0.998633        39920       731.43
       2.805     0.998828        39928       853.33
       3.003     0.999023        39936      1024.00
       3.097     0.999121        39939      1137.78
       3.191     0.999219        39943      1280.00
       3.329     0.999316        39947      1462.86
       3.431     0.999414        39951      1706.67
       3.579     0.999512        39955      2048.00
       3.643     0.999561        39957      2275.56
       3.773     0.999609        39959      2560.00
       3.799     0.999658        39961      2925.71
       3.907     0.999707        39963      3413.33
       4.007     0.999756        39965      4096.00
       4.051     0.999780        39966      4551.11
       4.065     0.999805        39967      5120.00
       4.155     0.999829        39968      5851.43
       4.179     0.999854        39969      6826.67
       4.223     0.999878        39970      8192.00
       4.223     0.999890        39970      9102.22
       4.271     0.999902        39971     10240.00
       4.271     0.999915        39971     11702.86
       4.455     0.999927        39972     13653.33
       4.455     0.999939        39972     16384.00
       4.455     0.999945        39972     18204.44
       4.519     0.999951        39973     20480.00
       4.519     0.999957        39973     23405.71
       4.519     0.999963        39973     27306.67
       4.519     0.999969        39973     32768.00
       4.519     0.999973        39973     36408.89
       4.647     0.999976        39974     40960.00
       4.647     1.000000        39974          inf
#[Mean    =        1.045, StdDeviation   =        0.240]
#[Max     =        4.644, Total count    =        39974]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  49994 requests in 50.00s, 3.19MB read
Requests/sec:    999.85
Transfer/sec:     65.42KB